// Напишите программу, которая принимает на вход цифру, 
// обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет

using Internal;

Console.WriteLine("Введите число");
int number = Convert.ToInt32(Console.ReadLine());



int WeekDay (int number)
{
    while (WeekDay > 5)
    {
        
    }
}